src/pages.org
#+title: wmedrano.dev Pages
#+author: Will Medrano
#+hugo_base_dir: ./..
#+hugo_section: ./

* About Me
:PROPERTIES:
:EXPORT_TITLE: About Me
:EXPORT_FILE_NAME: about
:EXPORT_DATE: 2023-04-16
:END:

I'm Will Medrano. I work as a Senior Software Engineer at Google. I deal with
very big data during my day job, but in my spare time I tinker with a variety of
things like:
- The Rust programming language.
- Audio for music creation purposes.
- Ergonomic keyboards.

** Notable Open Source Work

*** Rust JACK

https://github.com/rustaudio/rust-jack is a Rust wrapper over JACK. JACK is the
recommended Realtime audio API for Linux.

*** wmidi

https://github.com/rustaudio/wmidi is a midi encoding and decoding library. Midi
is a widely used digital interface to communicate musical data such as note
keypresses and parameter changes.

*** livi-rs

https://github.com/wmedrano-livi-rs is a Rust library for hosting LV2 plugins.

** Website Source Code

[[https://github.com/wmedrano/wmedrano.dev][source code]]

