content/about.md
+++
title = "About Me"
author = ["Will Medrano"]
date = 2023-04-16
draft = false
+++

<div class="ox-hugo-toc toc">

<div class="heading">Table of Contents</div>

- [Notable Open Source Work](#notable-open-source-work)
    - [Rust JACK](#rust-jack)
    - [wmidi](#wmidi)
    - [livi-rs](#livi-rs)
- [Website Source Code](#website-source-code)

</div>
<!--endtoc-->

I'm Will Medrano. I work as a Senior Software Engineer at Google. I deal with
very big data during my day job, but in my spare time I tinker with a variety of
things like:

-   The Rust programming language.
-   Audio for music creation purposes.
-   Ergonomic keyboards.


## Notable Open Source Work {#notable-open-source-work}


### Rust JACK {#rust-jack}

<https://github.com/rustaudio/rust-jack> is a Rust wrapper over JACK. JACK is the
recommended Realtime audio API for Linux.


### wmidi {#wmidi}

<https://github.com/rustaudio/wmidi> is a midi encoding and decoding library. Midi
is a widely used digital interface to communicate musical data such as note
keypresses and parameter changes.


### livi-rs {#livi-rs}

<https://github.com/wmedrano-livi-rs> is a Rust library for hosting LV2 plugins.


## Website Source Code {#website-source-code}

[source code](https://github.com/wmedrano/wmedrano.dev)
